Tekla Open API Reference for Tekla Structures 2025
DetailTypeAttribute Constructor
Overload List
Name | Description
DetailTypeAttribute(Int32)
 The custom attribute [DetailType()] uses this to store the type of the detail to the system. This is not to be used by itself.
DetailTypeAttribute(DetailTypeEnum)
 The custom attribute [DetailType()] uses this to store the type of the detail to the system. This is not to be used by itself.
Top
See Also
Reference
DetailTypeAttribute Class
Tekla.Structures.Plugins Namespace